Revit 2027 API
BuiltInFailures.StairRampFailures.CannotCreateOneOrMoreTreads Property
 Can't create geometry for one or more treads.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateOneOrMoreTreads { get; }
Public Shared ReadOnly Property CannotCreateOneOrMoreTreads As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateOneOrMoreTreads {
	FailureDefinitionId^ get ();
}
static member CannotCreateOneOrMoreTreads : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace